<template>
  <div>
    <h2 class="px-5" style="white-space: pre-wrap; word-wrap: break-word">
      {{ msg }}
    </h2>
    <!-- <p>
      現職はシステムエンジニアとして、設計・開発・テスト・・・と、主にウォーターフォール開発の案件業務に携わっています。
      新卒で配属・常駐業務をスタートさせてからこれまでずっと常駐先におり、様々な案件で業務アプリケーションの開発経験をしてきました。
      (最長で2年強、最短で6か月。メンバーは少ない規模で3名、大きい規模で約300人の規模での開発を経験しました。)
      主な担当業務としては、コーディング・テストが大半ですが、その他技術調査や、要件定義、設計書の作成・修正も経験させていただきま
      した。ある案件では、3名体制での作業と並行し、PMが複数の案件を掛け持ちしていたため、PMの補佐業務として工数の計算やスケ
      ジュールの調整、他チームとの連携・連絡をさせてもらう機会もあり、「開発側の視点」と「マネジメント側の視点」、両方を持っていると自負
      しています。
      また、これまで業務アプリケーションの案件に携わらせていただく中で、”ユーザはなぜこのシステムを必要としているのか”、”システムを利用す
      るときの満足感を得られるポイントはどこなのか”というのは常に考え、行動してきたと思っています。実際にユーザ様から「とても使いやすい」
      「満足している」と評価いただいたこともあります。メンバーの皆さんを巻き込んで、着手しているアプリケーションについて議論し、それを成功
      に導けた経験はとても自信になっています。
      個人的に自信になったと思う経験は、営業放送システムのシステム全体で使えるConverterを実装したことです。プロパティを一つ渡せ
      ば、細かい画面表示実装も特に意識することなく実装できるようにしました。煩雑になってしまう画面表示時の実装をConverterの実装
      で一手に引き受けた結果、プロジェクト全体での工数削減と保守性の高い実装を実現できました。元々MVVMパターンで開発が進んで
      いた強みを生かせたことと、各メンバーの実装が楽になるという成果を挙げられたのが良かったと思います。また、他チームの方々との調整も
      必要だったため、認識齟齬が起こらないような言葉選び・行間を読む力などが養われたと感じています。これらの経験をさせていただいたこ
      とで、より「他者のために働き、感謝されると嬉しい」と、自分の仕事感を知ることができました。
      これまでの案件で常に意識してきた「プロダクトの先の、ユーザ視点・体験を大切にすること」や、開発業務で「チーム開発において”チーム
      の成熟”が良いプロダクトを生む」を経験したこと生かし、人々の生活を支えるサービスを創出・開発・成長させていきたいと考えています。
    </p> -->
  </div>
</template>

<script>
export default {
  name: "AboutMe",
  props: {
    msg: String,
  },
};
</script>